"""
线性数据结构：数组、链表、栈、队列、哈希表，元素之间是一对一的顺序关系。
非线性数据结构：树、堆、图、哈希表。

树形结构：树、堆、哈希表，元素之间是一对多的关系。
网状结构：图，元素之间是多对多的关系。


基本数据类型：
    整数类型 byte、short、int、long 。
    浮点数类型 float、double ，用于表示小数。
    字符类型 char ，用于表示各种语言的字母、标点符号甚至表情符号等。
    布尔类型 bool ，用于表示“是”与“否”判断。

数字编码：
    原码、反码、补码
    原码：我们将数字的二进制表示的最高位视为符号位，其中 0 表示正数，1 表示负数，其余位表示数字的值。
    反码：正数的反码与其原码相同，负数的反码是对其原码除符号位外的所有位取反。
    补码：正数的补码与其原码相同，负数的补码是在其反码的基础上加 1 。

    浮点数的计算方式与整形的计算方式不一样，浮点数的精度比较低，整形的精度比较高

字符编码：
    ASCll码 就是一些特殊符号的规定编码集 特指英文
    GBK字符集
    Unicode字符集 这个字符集是目前最全的字符集
        UTF-8 已成为国际上使用最广泛的 Unicode 编码方法（属于unicode字符集编码分支）

"""






